note/2018/organize-life-with-org-mode/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-31 Fri 15:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Organize Life with Org Mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Organize Life with Org Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Some-references">Some references</a></li>
<li><a href="#Org-Agenda">Org Agenda</a>
<ul>
<li><a href="#TODOs">TODOs</a></li>
<li><a href="#Agenda-view">Agenda view</a></li>
<li><a href="#Bindings">Bindings</a></li>
</ul>
</li>
<li><a href="#Org-Capture">Org Capture</a></li>
</ul>
</div>
</div>

<div id="outline-container-org99b510c" class="outline-2">
<h2 id="Some-references">Some references</h2>
<div class="outline-text-2" id="text-Some-references">
<ul class="org-ul">
<li><a href="https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html">https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org493189e" class="outline-2">
<h2 id="Org-Agenda">Org Agenda</h2>
<div class="outline-text-2" id="text-Org-Agenda">
</div>
<div id="outline-container-org613a43e" class="outline-3">
<h3 id="TODOs">TODOs</h3>
<div class="outline-text-3" id="text-TODOs">
<p>
Set a todo file:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-agenda-files <span style="color: #a626a4;">(</span>list moon-todo-file<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Set some TODO keywords:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-todo-keywords
      '<span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span>sequence <span style="color: #50a14f;">"</span><span style="color: #cc9393;">TODO</span><span style="color: #50a14f;">"</span>
                  <span style="color: #50a14f;">"</span><span style="color: #dca3a3;">NEXT</span><span style="color: #50a14f;">"</span>
                  <span style="color: #50a14f;">"START"</span>
                  <span style="color: #50a14f;">"WAIT"</span>
                  <span style="color: #50a14f;">"DEFER"</span>
                  <span style="color: #50a14f;">"|"</span>
                  <span style="color: #50a14f;">"</span><span style="color: #afd8af;">DONE</span><span style="color: #50a14f;">"</span>
                  <span style="color: #50a14f;">"CANCEL"</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
Keywords after the bar is considered finished state. I set a custom "defer" face so it doesn't stand out (as it shouldn't):
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-todo-keyword-faces
      '<span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span><span style="color: #50a14f;">"DEFER"</span> . <span style="color: #da8548;">(</span><span style="color: #a626a4;">:inherit</span> default <span style="color: #a626a4;">:weight</span> bold<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1381c1c" class="outline-3">
<h3 id="Agenda-view">Agenda view</h3>
<div class="outline-text-3" id="text-Agenda-view">
<p>
Add a custom view:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-agenda-custom-commands
      '<span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span><span style="color: #50a14f;">"d"</span> <span style="color: #50a14f;">"Default Agenda View"</span>
         <span style="color: #da8548;">(</span><span style="color: #b751b6;">(</span>agenda <span style="color: #50a14f;">""</span><span style="color: #b751b6;">)</span>
          <span style="color: #b751b6;">(</span>todo <span style="color: #50a14f;">""</span>
                <span style="color: #986801;">(</span><span style="color: #4078f2;">(</span>org-agenda-skip-function '<span style="color: #80a880;">(</span>org-agenda-skip-entry-if 'scheduled 'deadline<span style="color: #80a880;">)</span><span style="color: #4078f2;">)</span>
                 <span style="color: #4078f2;">(</span>org-agenda-overriding-header <span style="color: #50a14f;">"Unscheduled/deadline tasks:"</span><span style="color: #4078f2;">)</span><span style="color: #986801;">)</span><span style="color: #b751b6;">)</span><span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
This view skips todo entries that are marked "scheduled" and "deadline", because they appear in agenda view already. My current agenda looks like
</p>
<pre class="example">
Week-agenda (W51):
Monday     17 December 2018 W51
  Other:      Scheduled:  DONE [#A] Write to professors
Tuesday    18 December 2018
Wednesday  19 December 2018
Thursday   20 December 2018
Friday     21 December 2018
Saturday   22 December 2018
Sunday     23 December 2018

===================================================================================
Unscheduled/deadline tasks:
  Other:      TODO [#A] resend pencil to sister alice
  Emacs:      TODO blog on org agenda
  Emacs:      DEFER moon shape based on day in month
  Emacs:      TODO Revise magic-font-book
  School:     WAIT Rent house for Spring
  Other:      TODO album list
  Other:      TODO 汉服资料
  Other:      TODO 完成财产目录
  Other:      TODO 完成好东西目录
  Other:      TODO Read about Maude programming lang
  Other:      TODO blog about uikit
  Other:      TODO blog about lodge skillet
  Other:      TODO read http://www.paulgraham.com/rootsoflisp.html
  Other:      TODO 用Common Lisp实现照片日志系统，ditch Apple Notes
  Other:      TODO blog: shrink code font size, fix code wrap
  Other:      TODO read art of meta
  Other:      TODO read on lisp
  Other:      TODO read GEB (book)
  Other:      TODO read little typer
  Other:      TODO [#C] take photo for album arts
  Other:      DEFER [#C] collapse for blog
  Other:      DEFER [#C] Embroidery
  Other:      DEFER [#C] twitter cwraler
</pre>

<p>
Noticed the <code>[#A]</code>'s? They are priorities. (<a href="https://orgmode.org/manual/Priorities.html">manual node</a>) I set custom faces to them:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-priority-faces
      '<span style="color: #a626a4;">(</span><span style="color: #50a14f;">(</span>?A . <span style="color: #da8548;">(</span><span style="color: #a626a4;">:inherit</span> font-lock-warning-face<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span>?B . <span style="color: #da8548;">(</span><span style="color: #a626a4;">:inherit</span> default<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span>
        <span style="color: #50a14f;">(</span>?C . <span style="color: #da8548;">(</span><span style="color: #a626a4;">:inherit</span> font-lock-comment-face<span style="color: #da8548;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
You can also add categories to you todo headers, <code>Emacs</code>, <code>Other</code>, <code>School</code> are my categories. Categories are just header properties, this is the "Emacs" header of my TODO file.
</p>
<div class="org-src-container">
<pre class="src src-org-mode">* Emacs
  :PROPERTIES:
 :CATEGORY: Emacs
 :END:
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf33b215" class="outline-3">
<h3 id="Bindings">Bindings</h3>
<div class="outline-text-3" id="text-Bindings">
<p>
Some useful default bindings:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-s</code></td>
<td class="org-left">schedule</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-d</code></td>
<td class="org-left">set deadline</td>
</tr>

<tr>
<td class="org-left"><code>S-&lt;left&gt;/&lt;right&gt;</code></td>
<td class="org-left">shift TODO state</td>
</tr>

<tr>
<td class="org-left"><code>t</code> (in agenda)</td>
<td class="org-left">toggle TODO state</td>
</tr>

<tr>
<td class="org-left"><code>S-&lt;up&gt;/&lt;down&gt;</code></td>
<td class="org-left">shift priorities</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb6eac34" class="outline-2">
<h2 id="Org-Capture">Org Capture</h2>
<div class="outline-text-2" id="text-Org-Capture">
<p>
I use it to quickly add entries to my TODO file. Here is my setup:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-default-notes-file <span style="color: #50a14f;">"~/note/index.org"</span><span style="color: #4078f2;">)</span>
<span style="color: #4078f2;">(</span><span style="color: #e45649;">setq</span> org-capture-templates
      <span style="color: #a626a4;">(</span>append org-capture-templates
              `<span style="color: #50a14f;">(</span><span style="color: #da8548;">(</span><span style="color: #50a14f;">"t"</span> <span style="color: #50a14f;">"TODOs"</span><span style="color: #da8548;">)</span>
                <span style="color: #da8548;">(</span><span style="color: #50a14f;">"te"</span> <span style="color: #50a14f;">"Emacs"</span> entry <span style="color: #b751b6;">(</span>file+olp <span style="color: #50a14f;">"~/note/todo.org"</span> <span style="color: #50a14f;">"Emacs"</span><span style="color: #b751b6;">)</span> <span style="color: #50a14f;">"*** </span><span style="color: #cc9393;">TODO</span><span style="color: #50a14f;"> %?"</span><span style="color: #da8548;">)</span>
                <span style="color: #da8548;">(</span><span style="color: #50a14f;">"th"</span> <span style="color: #50a14f;">"Homework"</span> entry <span style="color: #b751b6;">(</span>file+olp <span style="color: #50a14f;">"~/note/todo.org"</span> <span style="color: #50a14f;">"Homework"</span><span style="color: #b751b6;">)</span> <span style="color: #50a14f;">"*** </span><span style="color: #cc9393;">TODO</span><span style="color: #50a14f;"> %?"</span><span style="color: #da8548;">)</span>
                <span style="color: #da8548;">(</span><span style="color: #50a14f;">"to"</span> <span style="color: #50a14f;">"Other"</span> entry <span style="color: #b751b6;">(</span>file+olp <span style="color: #50a14f;">"~/note/todo.org"</span> <span style="color: #50a14f;">"Other"</span><span style="color: #b751b6;">)</span> <span style="color: #50a14f;">"*** </span><span style="color: #cc9393;">TODO</span><span style="color: #50a14f;"> %?"</span><span style="color: #da8548;">)</span>
                <span style="color: #da8548;">(</span><span style="color: #50a14f;">"ts"</span> <span style="color: #50a14f;">"School"</span> entry <span style="color: #b751b6;">(</span>file+olp <span style="color: #50a14f;">"~/note/todo.org"</span> <span style="color: #50a14f;">"School"</span><span style="color: #b751b6;">)</span> <span style="color: #50a14f;">"*** </span><span style="color: #cc9393;">TODO</span><span style="color: #50a14f;"> %?"</span><span style="color: #da8548;">)</span>
                <span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
<code>org-capture-templates</code>'s documentation is easy to follow, the <code>file+olp</code> part is like <code>(file+olp file-path header1 sub-header2 sub-sub-header3 ...)</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2018-11-26 Mon 00:00</p>
<p class-"last-modified">Last modified on 2020-07-31 Fri 15:45</p>
</div>
</body>
</html>
